In [ ]:
# This file (PyBer.ipynb) was created per instructions of Module 5.2.3: Load and Read the CSV files

In [ ]:
# Module 5.2.1 had instructions to download city_data.csv and ride_data.csv
# Module 5.2.1 url:
# https://courses.bootcampspot.com/courses/1225/pages/5-dot-2-1-import-and-inspect-csv-files?module_item_id=497694

In [8]:
# Module 5.2.2: 
# https://courses.bootcampspot.com/courses/1225/pages/5-dot-2-2-overview-of-the-project?module_item_id=497699


# Module 5.2.2 provided a list of steps and deliverables:

# Import your data into a Pandas DataFrame.
# Merge your DataFrames.

# Create a bubble chart that showcases the average fare versus the total number of rides with bubble size based on the total number of drivers for each city type, including urban, suburban, and rural.
# Determine the mean, median, and mode for the following:
# The total number of rides for each city type.
# The average fares for each city type.
# The total number of drivers for each city type.

# Create box-and-whisker plots that visualize each of the following to determine if there are any outliers:
# The number of rides for each city type.
# The fares for each city type.
# The number of drivers for each city type.

# Create a pie chart that visualizes each of the following data for each city type:
# The percent of total fares.
# The percent of total rides.
# The percent of total drivers.

In [ ]:
# ---Module 5.2.3: Load and Read the CSV files---

In [ ]:
# ---Load the CSV files---

In [2]:
# In the first cell, add the following code to import the Pandas and Matplotlib libraries with the Pyplot module, and run the cell:

# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [3]:
# In a new cell, declare variables that connect to the CSV files in the Resources folder:

# Files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [4]:
# REWIND: 
# If you want to use os.path.join() to load CSV files, 
# you need to import the os module with your dependencies, like this: import os

In [5]:
# To read a CSV file into Pandas, we use pd.read_csv. 
# Add the following code to a new cell:

# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [ ]:
# ---Read the Ride Data File---

In [6]:
# To load the ride_data.csv file into a Pandas DataFrame, 
# add the following code to a new cell:

# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [ ]:
# ---End of Module 5.2.3---

In [ ]:
# ---Module 5.2.4: Explore the Data in Pandas---

In [ ]:
# Often you'll be given more than one CSV file to work with and be asked to merge them to perform the analysis. Before you merge them, you should explore the data.

# Missing, malformed, or incorrect data could lead to a poor or incorrect analysis, and the last thing we want is to be standing in front of the CEO with faulty information!

In [ ]:
# We'll start off by inspecting each DataFrame. When we're satisfied that there is no missing, malformed, or incorrect data, we'll merge the DataFrames.

In [11]:
# Inspect the City Data DataFrame
# For the city_data_df DataFrame, we need to:

# Get all the rows that contain null values.
# Make sure the driver_count column has an integer data type.
# Find out how many data points there are for each type of city.
# First, let's get all the rows that are not null.

# REWIND
# To get the name of each column and the number of rows that are not null, we can use the df.count() method.

# Another option is to use df.isnull().sum() method chaining.

In [12]:
# # Get the columns and the rows that are not null.
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [13]:
# And to make sure there are no null values, we can type and run the following code:

# # Get the columns and the rows that are not null.
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [ ]:
# ^^^ (Output above): The output from this code shows that there are zero null values in all three columns.

In [14]:
# Next, we need to see if the driver_count column has a numerical data type because we plan to perform mathematical calculations on that column.
# REWIND: 
# To get the data types of each column, we use the dtypes on the DataFrame.

In [15]:
# Get the data types of each column.
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [ ]:
# ^^^ (Output above):  that the output shows the data types for each column. Most importantly, the data type for the driver_count column is an integer.

In [ ]:
# Finally, we'll check to see how many data points there are for each type of city. To do this, we'll use the sum() method on the city_data_df for the type column where the condition equals each city in the DataFrame.

# REWIND:
# We can use the unique() method on a specific column, which will return an array, or list, of all the unique values of that column

In [19]:
# Get the unique values of the type of city.
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [20]:
# ^^^ (Output above): an array of different types of cities.

# Now we can use the sum() method on the city_data_df for the type column where the condition equals either Urban, Suburban, or Rural.

# To get the number of data points for the Urban cities, add the following code:

# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

66

In [21]:
# ^^^ (Output above): that the number of data points for the Urban cities is 66.

In [22]:
sum(city_data_df["type"]=="Suburban")

36

In [23]:
sum(city_data_df["type"]=="Rural")

18

In [ ]:
# Inspect Ride Data DataFrame

In [24]:
# For the ride_data_df DataFrame, we need to:

# Get all the rows that contain null values.
# Make sure the fare and ride_id columns are numerical data types.
# First, let's get all the rows that are not null. Add the following code:

# Get the columns and the rows that are not null.
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [25]:
# And to make sure there are no null values, we can type and run the following code:

# Get the columns and the rows that are not null.
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [ ]:
# ^^^ (Output above): The output shows the data types for each column. And more importantly, the data types for the fare and ride_id columns are floating-point decimal, and integer, respectively.

In [ ]:
# Both of the DataFrames look good and can now be merged.

In [26]:
# Merge DataFrames

# Before we merge the DataFrames, let's review each DataFrame.

# The columns in the city_data_df DataFrame are:
# city
# driver_count
# type

# The columns in the ride_data_df are:
# city
# date
# fare
# ride_id

# REWIND:
# When we merge two DataFrames, we merge on a column with the same data, and the same column name, in both DataFrames. We use the following syntax to do that:
# new_df = pd.merge(leftdf, rightdf, on=["column_leftdf", "column_rightdf"])
# We may have to merge the DataFrames using the how= parameter either left, right, inner, or outer depending how we want to merge the DataFrames. The default is inner.

# Looking at the columns in the two DataFrames, we can see that the column the DataFrames have in common is city. Therefore, we will merge the two DataFrames on the city column, and then add the city_data_df to the end of the ride_data_df DataFrame with the constraint how="left".

In [30]:
city_data_df

                city  driver_count   type
0        Richardfort            38  Urban
1       Williamsstad            59  Urban
2        Port Angela            67  Urban
3         Rodneyfort            34  Urban
4        West Robert            39  Urban
..               ...           ...    ...
115     Bradshawfurt             7  Rural
116     New Ryantown             2  Rural
117   Randallchester             9  Rural
118      Jessicaport             1  Rural
119  South Saramouth             7  Rural

[120 rows x 3 columns]

In [31]:
ride_data_df

                    city                 date   fare        ride_id
0     Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1     South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2     Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3             Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4             South Jack  2019-03-06 04:28:35  34.58  3908451377344
...                  ...                  ...    ...            ...
2370         Michaelberg  2019-04-29 17:04:39  13.38  8550365057598
2371     Lake Latoyabury  2019-01-30 00:05:47  20.76  9018727594352
2372         North Jaime  2019-02-10 21:03:50  11.11  2781339863778
2373        West Heather  2019-05-07 19:22:15  44.94  4256853490277
2374          Newtonview  2019-04-25 10:20:13  55.84  9990581345298

[2375 rows x 4 columns]

In [27]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [ ]:
# ^^^ (Output above): In the pyber_data_df DataFrame, all the columns from the city_data_df are the first four columns after the index. The driver_count and type columns from the ride_data_df are added at the end.

In [ ]:
# ---End of Module 5.2.4---

In [33]:
# (per Module 5.2.5, commit code onto GitHub.)